* TD2
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | td2
Descriptive Name                      | 
Area                                  | Paakitsoq
Data reference                        | Unknown PDF: See td1
Data DOI                              | 
Science reference                     | 
Science DOI                           | 
Date                                  | 1988-05-19
Longitude [°E]                        | -50.13
Latitude [°N]                         | 69.45
Location source                       | Unknown PDF: See td1
Depth of top measurement [m]          | 27.0
Depth of bottom measurement [m]       | 202.0
Ice thickness [m]                     | 470
Coverage [% of thickness]             | 37
Ice thickness source                  | Unknown PDF: See td1
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

+ See td1 Shallow88II.pdf

** Thickness

+ From PDF
 
** Location

+ From PDF

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv
#+END_SRC

#+RESULTS: ingest_data
|   d |    t |
|  27 | -2.8 |
|  52 | -2.4 |
|  77 | -2.3 |
| 102 | -2.3 |
| 127 |   -2 |
| 152 | -2.1 |
| 177 |   -2 |
| 192 | -2.2 |
| 202 | -2.2 |

